app/controllers/api/favorites_controller.rb

INSERT INTO "favorites" ("created_at", "favorable_id", "favorable_type", "updated_at", "user_id") VALUES ($1, $2, $3, $4, $5) RETURNING "id"
---
  def create
    fav_type = params[:fav_type]

    classes = { "entry" => "Entry", "feed" => "Feed" }
    @favorite = Favorite.new(user_id: current_user.id, favorable_type: classes[fav_type], favorable_id: Integer(params[:favorable_id]))

    unless @favorite.save